#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2021-07-25 Sun 19:24]
| Headline             |      Time |      |
|----------------------+-----------+------|
| *Total time*         | *1d 0:56* |      |
|----------------------+-----------+------|
| agenda estudio       |      7:54 |      |
| \_  [2021-07-20 Tue] |           | 4:23 |
| \_  [2021-07-21 Wed] |           | 3:31 |
| agenda programacion  |     16:04 |      |
| \_  [2021-07-20 Tue] |           | 0:57 |
| \_  [2021-07-21 Wed] |           | 0:56 |
| \_  [2021-07-22 Thu] |           | 4:12 |
| \_  [2021-07-23 Fri] |           | 3:46 |
| \_  [2021-07-24 Sat] |           | 3:04 |
| \_  [2021-07-25 Sun] |           | 3:09 |
| agenda editores      |      0:58 |      |
| \_  intento vim      |           | 0:58 |
#+END:

* agenda estudio
** [2021-07-20 Tue]
*** bash - test/if/arrays/for
    :LOGBOOK:
    CLOCK: [2021-07-20 Tue 12:24]--[2021-07-20 Tue 12:52] =>  0:28
    CLOCK: [2021-07-20 Tue 11:28]--[2021-07-20 Tue 12:13] =>  0:45
    :END:
*** python 
    :LOGBOOK:
    CLOCK: [2021-07-20 Tue 17:34]--[2021-07-20 Tue 18:40] =>  1:06
    CLOCK: [2021-07-20 Tue 14:08]--[2021-07-20 Tue 14:50] =>  0:42
    :END:
*** bash challenger
    :LOGBOOK:
    CLOCK: [2021-07-20 Tue 18:51]--[2021-07-20 Tue 20:13] =>  1:22
    :END:
** [2021-07-21 Wed]
   :LOGBOOK:
   CLOCK: [2021-07-21 Wed 17:35]--[2021-07-21 Wed 18:53] =>  1:18
   CLOCK: [2021-07-21 Wed 13:50]--[2021-07-21 Wed 14:39] =>  0:49
   CLOCK: [2021-07-21 Wed 11:17]--[2021-07-21 Wed 12:10] =>  0:53
   CLOCK: [2021-07-21 Wed 11:02]--[2021-07-21 Wed 11:09] =>  0:07
   CLOCK: [2021-07-21 Wed 10:26]--[2021-07-21 Wed 10:50] =>  0:24
   :END:
* agenda programacion
** [2021-07-20 Tue]
*** poner modal de los nuevos en ventas/listado/editar
    :LOGBOOK:
    CLOCK: [2021-07-20 Tue 15:20]--[2021-07-20 Tue 16:17] =>  0:57
    :END:
    puse modal nuevo y subi a romitex.xyz y corregi el bug de la
    transparencia en los modales del thead de las tablas que tenia
    zindex 10. 
** [2021-07-21 Wed]
   :LOGBOOK:
   CLOCK: [2021-07-21 Wed 15:45]--[2021-07-21 Wed 16:41] =>  0:56
   :END:
   subida de base de datos al dia a romitex.xyz y correccion de bug
   que se presento que aparentemente no andaban los usuarios luego de
   la configuracion de la base de datos.
** [2021-07-22 Thu]
   :LOGBOOK:
   CLOCK: [2021-07-22 Thu 15:01]--[2021-07-22 Thu 16:02] =>  1:01
   CLOCK: [2021-07-22 Thu 09:51]--[2021-07-22 Thu 13:02] =>  3:11
   :END:
   tab de ventas/morosidad que calcula un campo en la tabla ventas de
   las cuotas vencidas y le resta lo pagado, y eso lo pasa como
   morosidad.
   La ultima hora la pase con un filtro interesante hecho con js sobre
   los datos ya levantados.
** [2021-07-23 Fri]
   :LOGBOOK:
   CLOCK: [2021-07-23 Fri 17:22]--[2021-07-23 Fri 17:50] =>  0:28
   CLOCK: [2021-07-23 Fri 14:44]--[2021-07-23 Fri 17:02] =>  2:18
   CLOCK: [2021-07-23 Fri 09:09]--[2021-07-23 Fri 10:09] =>  1:00
   :END:
    se comenzo a desarrollar un nuevo pagos.html que reemplaze el anterior
    desarrollado en vue. Similar pero con las nuevas tecnologias.
** [2021-07-24 Sat]
   :LOGBOOK:
   CLOCK: [2021-07-24 Sat 18:40]--[2021-07-24 Sat 19:29] =>  0:49
   CLOCK: [2021-07-24 Sat 15:46]--[2021-07-24 Sat 16:46] =>  1:00
   CLOCK: [2021-07-24 Sat 14:43]--[2021-07-24 Sat 15:10] =>  0:27
   CLOCK: [2021-07-24 Sat 12:34]--[2021-07-24 Sat 13:22] =>  0:48
   :END:
** [2021-07-25 Sun]
   :LOGBOOK:
   CLOCK: [2021-07-25 Sun 17:45]--[2021-07-25 Sun 18:44] =>  0:59
   CLOCK: [2021-07-25 Sun 16:14]--[2021-07-25 Sun 17:11] =>  0:57
   CLOCK: [2021-07-25 Sun 14:30]--[2021-07-25 Sun 14:53] =>  0:23
   CLOCK: [2021-07-25 Sun 12:25]--[2021-07-25 Sun 13:15] =>  0:50
   :END:
perdida de tiempo brutal con el no funcionamiento de .up .down en
alpine 3.22 lo reemplace con page-up page-down, pero me llevo tiempo
descubrir que la falla estaba en el binding y no tenia yo la culpa en
el js que estaba poniendo adentro.
** [2021-07-26 Mon]
   :PROPERTIES:
   :ORDERED:  t
   :END:
   :LOGBOOK:
   CLOCK: [2021-07-26 Mon 12:45]--[2021-07-26 Mon 13:40] =>  0:55
   CLOCK: [2021-07-26 Mon 11:10]--[2021-07-26 Mon 12:10] =>  1:00
   :END:

* agenda editores 
** intento vim
** [2021-07-24 Sat]
   :LOGBOOK:
   CLOCK: [2021-07-24 Sat 11:35]--[2021-07-24 Sat 12:33] =>  0:58
   :END:
   intento de ponerle lsp. actualice a nvim 0.6
** [2021-07-26 Mon]
   :LOGBOOK:
   CLOCK: [2021-07-26 Mon 09:50]--[2021-07-26 Mon 10:26] =>  0:36
   :END:
   logre que abra maximizado y en el directorio de trabajo, lo que me
   ahorra un par de segundos de tarea repetitiva, y baje las cheat
   sheet para comenzar a profundizar
